---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTraySizes.ClearAll
source: html/9be03014-448d-a06e-2b4c-6f8dafa914aa.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySizes.ClearAll Method

Removes all MEPSizes in the cable tray sizes.

## Syntax (C#)
```csharp
public void ClearAll()
```